src/cf/Enums/РазделыУчетаДляВводаОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>РазделыУчетаДляВводаОстатков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновныеСредства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НематериальныеАктивыИНИОКР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапитальныеВложения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСПоПриобретеннымЦенностям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НезавершенноеПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотоваяПродукцияИПолуфабрикаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыОтгруженные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежныеСредства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСПоставщикамиИПодрядчиками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСПокупателямиИЗаказчиками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоНалогамИСборам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСПерсоналомПоОплатеТрудаИДепонентам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСПодотчетнымиЛицами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСУчредителями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСПрочимиДебиторамиИКредиторами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСПоАвансамПолученным</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Капитал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыБудущихПериодов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложенныеНалоговыеАктивыОбязательства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеСчетаБухгалтерскогоУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДСНачисленный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасходыНалоговогоУчетаУСНиИП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпецоснасткаВЭксплуатации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АрендаЛизинг</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/РазделыУчетаДляВводаОстатков/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ДанныеВыбораПоФункциональнымОпциям();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Убирает из полного списка разделов те, фунцкионал ведения учета по которым не включен.
//
// Возвращаемое значение:
//  СписокЗначений - список, куда добавлены все возможные (из используемых) разделы учета.
//
Функция ДанныеВыбораПоФункциональнымОпциям() Экспорт
	
	СписокРазделов = Новый СписокЗначений;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РазделыУчетаДляВводаОстатков.Ссылка КАК СсылкаЗначение,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(РазделыУчетаДляВводаОстатков.Ссылка) КАК СсылкаПредставление
	|ИЗ
	|	Перечисление.РазделыУчетаДляВводаОстатков КАК РазделыУчетаДляВводаОстатков
	|
	|УПОРЯДОЧИТЬ ПО
	|	РазделыУчетаДляВводаОстатков.Порядок");
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Раздел = Выборка.СсылкаЗначение;
		Если (Раздел = АрендаЛизинг Или Раздел = ОсновныеСредства)
			И Не ПолучитьФункциональнуюОпцию("ВедетсяУчетОсновныхСредств")
		 Или Раздел = КапитальныеВложения
			И Не ПолучитьФункциональнуюОпцию("ВедетсяУчетОсновныхСредств") И Не ПолучитьФункциональнуюОпцию("ВедетсяУчетНМА")
		 Или Раздел = НематериальныеАктивыИНИОКР
			И Не ПолучитьФункциональнуюОпцию("ВедетсяУчетНМА")
		 Или (Раздел = РасчетыСПерсоналомПоОплатеТрудаИДепонентам Или Раздел = РасчетыСПодотчетнымиЛицами)
			И Не УчетЗарплаты.ИспользуетсяПодсистемаУчетаЗарплатыИКадров()
		 Или Раздел = СпецоснасткаВЭксплуатации
			И Не ПолучитьФункциональнуюОпцию("ВедетсяУчетСпецодеждыСпецоснастки") Тогда
			Продолжить;
		КонецЕсли;
		
		СписокРазделов.Добавить(Выборка.СсылкаЗначение, Выборка.СсылкаПредставление);
	
	КонецЦикла;
	
	Возврат СписокРазделов;
	
КонецФункции

#КонецОбласти	
	
#КонецЕсли
